Catalogs/НастройкиБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиБизнесПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБизнесПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТочекМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияДн</Name>
							<Comment>Период выполнения дней</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияЧас</Name>
							<Comment>Период выполнения часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияДн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияЧас</Name>
							<Comment>Период оповещения - часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Comment>Настройка вложенного бизнес процесса</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияМин</Name>
							<Comment>Период выполнения часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияМин</Name>
							<Comment>Период оповещения - часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИсполнителейЗадач</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыБизнесПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаТоваровРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаТоваровАТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеЗаказаПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиБизнесПроцессов/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает строковое имя бизнес процесса по значению реквизита "ВидБизнесПроцесса"
//
Функция ПолучитьСтроковоеИмябизнесПроцесса(лВидБизнесПроцесса = Неопределено) Экспорт

	Возврат ВидБизнесПроцесса.Метаданные().ЗначенияПеречисления[Перечисления.ВидыБизнесПроцессов.Индекс(?(лВидБизнесПроцесса = Неопределено, ВидБизнесПроцесса, лВидБизнесПроцесса))].Имя;

КонецФункции // ПолучитьСтроковоеИмябизнесПроесса()

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет корректность заполнения настройки для бизнес-процесса
// СогласованияЗаказаПокупателя.
//
// Параметры:
//  Отказ - булево, признак отказа от записи.
//  Заголовок - строка, заголовок сообщения.
//
Процедура ПроверитьКорректностьЗаполненияДляСогласованияЗаказа(Отказ, Заголовок)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Точки.ТочкаМаршрута КАК ТочкаМаршрута,
	|	Исполнители.Исполнитель КАК Исполнитель,
	|	Точки.Выполнять КАК Выполнять
	|ИЗ
	|	Справочник.НастройкиБизнесПроцессов.ПараметрыТочекМаршрута КАК Точки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиБизнесПроцессов.Исполнители КАК Исполнители
	|		ПО Точки.Ссылка = Исполнители.Ссылка
	|			И Точки.ТочкаМаршрута = Исполнители.ТочкаМаршрута
	|ГДЕ
	|	Точки.Ссылка      = &Ссылка
	|	И Точки.Выполнять = Истина");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Не Выборка.Выполнять Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Выборка.Исполнитель) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Точка маршрута ""';uk='Точка маршруту ""'") + Выборка.ТочкаМаршрута+ НСтр("ru=' "" не имеет исполнителей';uk=' ""не має виконавців'"), Отказ , Заголовок);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьКорректностьЗаполненияДляСогласованияЗаказа()

// Процедура проверяет корректность заполнения настройки для бизнес-процесса
// ПереоценкаТоваровРозница.
//
// Параметры:
//  Отказ - булево, признак отказа от записи.
//  Заголовок - строка, заголовок сообщения.
//
Процедура ПроверитьКорректностьЗаполненияДляПереоценкиТоваровРозница(Отказ, Заголовок)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Параметры.ТочкаМаршрута КАК ТочкаМаршрута,
	|	Параметры.Настройка КАК Настройка,
	|	Параметры.Выполнять КАК Выполнять
	|ИЗ
	|	Справочник.НастройкиБизнесПроцессов.ПараметрыТочекМаршрута КАК Параметры
	|ГДЕ
	|	Параметры.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Не Выборка.Выполнять Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Выборка.Настройка) И 
			Выборка.ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.ВложенныйБизнесПроцесс Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Для точки маршрута ""';uk='Для точки маршруту ""'") + Выборка.ТочкаМаршрута + НСтр("ru='"" не заполнен реквизит ""Настройка""';uk='"" не заповнений реквізит ""Настройка""'"), Отказ, Заголовок);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьКорректностьЗаполненияДляПереоценкиТоваровРозница()

// Процедура проверяет наличие ссылок в бизнес-процессах на настройку.
//
// Параметры:
//  ВидБизнесПроцесса - ПеречислениеСсылка.ВидыБизнесПроцессов.
//  Отказ - булево, признак отказа от записи.
//  Заголовок - строка, заголовок сообщения.
//
Процедура ПроверитьНаличиеСсылокНаНастройку(ВидБизнесПроцесса, Отказ, Заголовок)

	ТаблицаБизнесПроцесса = ПолучитьСтроковоеИмябизнесПроцесса(ВидБизнесПроцесса);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаДанных.Ссылка
	|ИЗ
	|	БизнесПроцесс." + ТаблицаБизнесПроцесса + " КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.Настройка = &Настройка");

	Запрос.УстановитьПараметр("Настройка" , Ссылка);

	Если Не Запрос.Выполнить().Пустой() Тогда

		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Существуют бизнес-процессы по данной настройке."
"Вид бизнес-процесса не может быть изменен!';uk='Існують бізнес-процеси по даній настройці."
"Вид бізнес-процесу не може бути змінений!'"), Отказ, Заголовок);

	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаличиеСсылокНаНастройку()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПриЗаписи" объекта.
//
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Заголовок = НСтр("ru='Запись элемента: ';uk='Запис елемента: '") + ЭтотОбъект;

	Если ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.СогласованиеЗаказаПокупателя Тогда

		ПроверитьКорректностьЗаполненияДляСогласованияЗаказа(Отказ, Заголовок);

	ИначеЕсли ВидБизнесПроцесса = Перечисления.ВидыБизнесПроцессов.ПереоценкаТоваровРозница Тогда

		ПроверитьКорректностьЗаполненияДляПереоценкиТоваровРозница(Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПриЗаписи()

// Процедура - обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Заголовок = НСтр("ru='Запись элемента: ';uk='Запис елемента: '") + ЭтотОбъект;

	Если Не ЗначениеЗаполнено(ВидБизнесПроцесса) Тогда

		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено значение реквизита ""Вид бизнес-процесса""';uk='Не заповнено значення реквізиту ""Вид бізнес-процесу""'"), Отказ , Заголовок);

	КонецЕсли;

	Если Не ЭтоНовый() Тогда

		Если ВидБизнесПроцесса <> Ссылка.ВидБизнесПроцесса Тогда

			ПроверитьНаличиеСсылокНаНастройку(Ссылка.ВидБизнесПроцесса, Отказ, Заголовок);

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
